j20-immigration/j20-immigration.org
#+OPTIONS: broken-links:t todo:nil
#+AUTHOR: Hawaii J20
#+hugo_base_dir: /home/dk/Public/projects/958-web-site/public-node/j20-immigration/
#+hugo_auto_set_lastmod: t
** DONE Hasn't the US always deported undocumented immigrants?
   CLOSED: [2018-06-23 Sat 08:58]
   :PROPERTIES:
   :EXPORT_FILE_NAME: always-deported
   :EXPORT_HUGO_MENU: :menu "main"
   :END:

*** Question:
Undocumented immigrants are deportable. Hasn't the US always deported
undocumented immigrants?

*** Background:
The U.S. is a nation of immigrants.

For more than a century after the nation was founded in 1776, immigration was
not regulated.  Immigrants did not need documentation.

The [[https://www.fairus.org/legislation/reports-and-analysis/history-of-us-immigration-laws][federal government first began to regulate immigration in 1875]], when it
prohibited entry to prostitutes and criminals. At this time, the U.S. welcomed
most immigrants. The Statue of Liberty, a monument to the nation's welcoming
attitude toward immigrants started construction in 1875.

In 1882, the Chinese exclusion law prohibited immigration of Chinese and first
empowered the federal government to deport immigrants. The [[https://en.wikipedia.org/wiki/Geary_Act][Geary Act of 1892]]
required Chinese to apply for certificates of residence; Chinese without
certificates were the first immigrants to be deported because they were
undocumented. Undocumented immigrants from other nations were not deported. The
Chinese exclusion act was repealed in 1943.

The first limit on the number of immigrants was imposed in 1921.

More recently, the Obama administration was responsible for deporting
millions of undocumented immigrants who had committed serious crimes. However,
those who had committed no serious crime were allowed to remain in the U.S.

Today, the Trump administration seeks to deport all undocumented immigrants
without exception, whether they have committed a serious crime or not. The
federal Immigration and Customs Enforcement agency (ICE) has recently used
increasingly harsh tactics to identify and deport undocumented immigrants,
including separating children from their parents.

*** Answer:

For much of its history, the U.S. welcomed undocumented immigrants and gave them
a path to citizenship. The first undocumented immigrants to be deported in 1892
were Chinese, a racist practice that ended in 1943. Since that time deportation
of undocumented immigrants has been selective. The Trump administration's plan
to deport all undocumented immigrants is novel.


